================================================================================
Basic Option
================================================================================

option TestFlag<"a", "all"> = String

--------------------------------------------------------------------------------

(source_file
    (option_declaration
    argument_id: (identifier)
    parameters: (parameter_list
        short: (string_literal)
        long: (string_literal))
    type: (optional_type_name
        type_id: (identifier))))

================================================================================
Option with long None
================================================================================

option TestFlag<"a", None> = String

--------------------------------------------------------------------------------

(source_file
    (option_declaration
    argument_id: (identifier)
    parameters: (parameter_list
        short: (string_literal)
        long: (none))
    type: (optional_type_name
        type_id: (identifier))))

================================================================================
Option with short None
================================================================================

option TestFlag<None, "all"> = String

--------------------------------------------------------------------------------

(source_file
    (option_declaration
    argument_id: (identifier)
    parameters: (parameter_list
        short: (none)
        long: (string_literal))
    type: (optional_type_name
        type_id: (identifier))))

================================================================================
Option with Optional String
================================================================================

option TestFlag<None, "all"> = Int ?

--------------------------------------------------------------------------------

(source_file
    (option_declaration
    argument_id: (identifier)
    parameters: (parameter_list
        short: (none)
        long: (string_literal))
    type: (optional_type_name
        type_id: (identifier))))

================================================================================
Option with Optional Literal
================================================================================

option TestFlag<None, "all"> = "asdf" ?

--------------------------------------------------------------------------------

(source_file
    (option_declaration
    argument_id: (identifier)
    parameters: (parameter_list
        short: (none)
        long: (string_literal))
    type: (optional_type_name
        (literal_union_type
            (string_literal_union_type
                (string_literal))))))

================================================================================
Option with Optional Literal
================================================================================

option TestFlag<None, "all"> = "abc" | "def" ?

--------------------------------------------------------------------------------

(source_file
    (option_declaration
    argument_id: (identifier)
    parameters: (parameter_list
        short: (none)
        long: (string_literal))
    type: (optional_type_name
        (literal_union_type
            (string_literal_union_type
                (string_literal)
                (string_literal))))))

================================================================================
Option with Optional Literal and Int Error
================================================================================

option TestFlag<None, "all"> = "abc" | 11 ?

--------------------------------------------------------------------------------
    (source_file
      (option_declaration
        (identifier)
        (parameter_list
          (none)
          (string_literal))
        (optional_type_name
          (literal_union_type
            (string_literal_union_type
              (string_literal)))
          (ERROR
            (int_literal)))))
